#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_DEV.module.moh_applications.module.PLR.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/dc7b9502-3ffa-4ff8-be2e-ebfebe650590/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/2ea1ec2c-1603-46a2-a348-6d0c7ce559da]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr"]: Refreshing state... [id=a85e6591-57e7-4eeb-a3da-8f8d96ceafe8/d9c10e7f-f9ad-4d47-95ea-c1b0c801098b]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=a85e6591-57e7-4eeb-a3da-8f8d96ceafe8/8742c7c0-664c-4321-8225-f70420d299f7]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=a85e6591-57e7-4eeb-a3da-8f8d96ceafe8/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/1ba3bbcb-d2db-4cb3-be33-2f88062e0dac]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-gis"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/631d7ff0-b506-4152-b099-2493591b8300]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/8742c7c0-664c-4321-8225-f70420d299f7]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/beddbeb0-650e-4bd9-8484-d05f789c61b6]
module.KEYCLOAK_DEV.module.moh_applications.module.PRIME-WEBAPP-ENROLLMENT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=moh_applications/client/a4813cde-5496-479b-864c-9872cdbdc157/scope-mappings/2ddc7173-34f3-41ff-9beb-66c7802717ce/f539f4bf-ba7a-4ba3-a8d4-a47f786e205d]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/458dd0fd-a742-4df1-b3ef-56ac85d7d8a9]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/86ec4f91-45fb-4e65-ae4f-e1b952fd4e47]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/c043fe54-6899-4e2e-94b6-a85c0051b7ab]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/f7e7a2f0-6e8c-4037-ae60-439017c25321/cada8e04-363d-4213-a77f-2991c3fa50a3]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/1814fe67-a84e-4ca7-9bcc-656b02c64c98]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/3ab21315-dcb9-40fb-92e6-81b40759e8d6]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/60dfb3b9-5ceb-4498-a24c-9641796bd991/43bf4fca-777a-4c9c-9127-f9677c654fef]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/7489c26e-77c8-47ad-9c07-a9bb97a37d91]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/65d6f8b7-0703-46ed-9ced-55457bd6c14b]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/c887cf6e-ee42-4807-a8b5-77b6c46fe218]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/f3d5d424-88cb-472f-a0b9-b99cc342f40f]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/6f46c738-d23e-4451-988a-7294bc52a402/scope-mappings/dc7b9502-3ffa-4ff8-be2e-ebfebe650590/30f494e9-41c7-40eb-9660-a14bb8248af4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.LICENCE-STATUS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "BEARER-ONLY"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "LICENCE-STATUS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Created for DMFT and PIDP to hold licence status roles."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.LICENCE-STATUS.module.client-roles.keycloak_role.ROLES["MOA"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MOA"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.LICENCE-STATUS.module.client-roles.keycloak_role.ROLES["PRACTITIONER"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "PRACTITIONER"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-licence-status"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "55c07ad0-ac04-4eed-b98a-85aa8551163f"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "7032f402-7431-4510-90e7-e7e21a33b253"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-licence-status"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-licence-status"
      + service_account_user_id = "c7a70148-52e9-4158-8b2f-238eb8269328"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @nathanielcx, Action: `pull_request`*